#define  _CRT_SECURE_NO_WARNINGS 1

/********************~操作符**************************/
//#include<stdio.h>
//int main()
//{ 
//	int a = 0;
//	//~    按位（二进制位）取反
//	//0000000000000000000000000000
//	//1111111111111111111111111111  ——内存——补码
//	//打印出的值是原码对应的值
//	//1000000000000000000000000001   -1
//	printf("%d\n",~a);  //-1
//	return 0;
//}
/********************&操作符**************************/
//#include<stdio.h>
//int main()
//{
//	int a = 13;
//	//0000 0000 0000 0000 0000 0000 0000 1101
//  //Q:0000 0000 0000 0000 0000 0000 0000 0010  //相当于把1向左移一位
// //A：0000 0000 0000 0000 0000 0000 0000 0010 相或
//	a & (1 << 1);
//	//0000 0000 0000 0000 0000 0000 0000 1111 a
// //Q：0000 0000 0000 0000 0000 0000 0000 1101 //相当于把1向左移一位
////A： 1111 1111 1111 1111 1111 1111 1111 1101 相与
//	//0000 0000 0000 0000 0000 0000 0000 0010
//	a & ~(1 << 1);
//	printf("%d\n");
//	return 0;
//}

/********************多组输入*************************/
//#include<stdio.h>
//int main()
//{
//	/*
//	scanf() - EOF ---> -1
//	~ -1    ----> 0
//	*/
//	while (scanf("%d", &n) != EOF)
//	while (~scanf("%d", &n))
//	return 0;
//}
/********************前置后置++--*************************/
//#include<stdio.h>
//int main()
//{
//	//int a = 10;
//	//int b = ++a;  //前置：先++，后使用
//	//printf("a = %d,b = %d\n", a, b);  //a = 11  b = 11
//	//printf("a = %d\n", ++a);  //a = 11
//
//	//int a = 10;
//	//int b = a++;  //后置：先使用，后++
//	////printf("a = %d,b = %d\n", a, b);  //a = 11  b = 10
//	//printf("a = %d\n", a++);  //a = 11
//
//	//int a = 10;
//	//int b = --a;//前置：先--，后使用
//	//printf("a = %d,b = %d\n", a, b);  //a = 9  b = 9
//	//printf("a = %d\n", --a);  //a = 9
//
//	int a = 10;
//	int b = a--;//后置：先使用，后--
//	//printf("a = %d,b = %d\n", a, b);  //a = 9  b = 10
//	printf("a = %d\n", a--);  //a = 9
//	return 0;
//}

/********************强制类型转换*************************/
//#include<stdio.h>
//int main()
//{
//	int a = (int)3.14;
//	printf("%d\n",a);
//	return 0;
//}

/********************sizeof*************************/
//#include <stdio.h>
//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//(2)
//	//求的是数组首元素指针变量的大小
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//(4)
//	//不用类型的指针变量都是4个字节，存放的都是地址，地址是由32个bit位组成，也就是4个字节
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1)
//	printf("%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//	return 0;
//}
//// 40 10 4 4

/********************逻辑操作符*************************/
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 4;
//	int c = a && b;  //1
//	int d = a || b;
//	return 0;
//}

/********************练习*************************/
//#include<stdio.h>
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	printf("a = %d\n b = %d\n c = %d\n d = %d\n",a,b,c,d);
//	//a = 1  b = 2  c = 3  d = 4
//	printf("%d\n",i);  //i = 0
//	//表达式中如果有0，后面的就不算了
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	printf("a = %d\n b = %d\n c = %d\n d = %d\n", a, b, c, d);
//	//a = 2  b = 3  c = 3  d = 5
//	printf("%d\n", i);  //i = 1
//	//表达式中如果左边操作数为0，右边的就不算了
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;
//	printf("a = %d\n b = %d\n c = %d\n d = %d\n", a, b, c, d);
//	//a = 2  b = 2  c = 3  d = 4
//	printf("%d\n", i);  //i = 1
//	//表达式中左边操作数如果为1，右边的就不算了
//	return 0;
//}
//int main()
//{
//	int a = 40;
//	int b = 0;
//	/*if (a > 5)
//		b = 3;
//	else
//		b = -3;
//*/
//	b = ((a > 5) ? (3) : (-3));
//	printf("%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	int b = 3;
//	int max = (a > b) ? (a) : (b);
//	return 0;
//}

/********************下标引用*************************/
//int main()
//{
//	int arr[10] = { 0 };
//	arr[4] = 4;//[] - 下标引用操作符 - [] 的操作数  arr, 4
//	printf("%d\n", arr[4]);
//	return 0;
//}

/********************函数引用*************************/
//
//void test()
//{
//	printf("hehe\n");
//}
//
////函数名前面的返回值类型，可以省略，但是省略掉后，默认返回的是整形
//
//int Add(int x, int y)
//{
//	return x + y;
//}
//
//int main()
//{
//	test();//()函数调用操作符 - 操作数 test
//	Add(2, 3);//() - 操作数 Add,2,3
//	//
//	//函数调用操作符的操作数至少有一个
//	//
//	return 0;
//}
//
//
/********************结构体引用*************************/
//struct Stu
//{
//	//结构成员
//	char name[20];//名字
//	int age;
//	char sex[5];
//};
//
//int main()
//{
//	//结构成员访问操作符-建立在结构体（联合体）上的
//	struct Stu s = {"zhangsan", 20, "nan"};
//	printf("%s\n", s.name);
//	printf("%d\n", s.age);
//	printf("%s\n", s.sex);//结构体变量.结构成员
//
//
//	//通过指针
//	struct Stu* ps = &s;
//	//拿到了ps
//	printf("%s\n", (*ps).name);//繁琐
//	printf("%s\n", ps->name);//简化
//	//->   结构体的指针->结构成员
//
//	return 0;
//}
//

/********************优先级顺序*************************/
//int main()
//{
//	int a = 3 + (2 - 4) * 6;//优先级决定计算顺序
//	int b = 3 + 5 + 8;//相邻2个操作符优先级相同，这是结合性说了算
//
//
//	return 0;
//}
 
/********************整型提升*************************/
//#include<stdio.h>
//int main()
//{
//	//char --> signed char
//	char a = 3;
//	//00000000000000000000000000000011     //截断
//	//00000011-a   一个字节只能存8个bit位
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111-b
//	char c = a + b;
//	//a和b的大小不够一个整形大小，所以要发生整形提升
//	//整形提升是按照变量原符号位来提升的~
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010 相加
//	//10000010-c
//	//11111111111111111111111110000010 - 补码
//	//11111111111111111111111110000001 - 反码
//	//10000000000000000000000001111110 - 原码
//	printf("%d\n", c);//? -126
//	//%d - 按有符号整形打印的
//	return 0;
//}
//a和b的值被提升为普通整型，然后再执行加法运算
//加法运算完成之后，结果将被截断，然后再存储于c，最后再整型提升后打印出来

/********************整型提升实例*************************/
//实例1
//#include<stdio.h>
//int main()
//{
//	char a = 0xb6;//10110110
//	short b = 0xb600;
//	int c = 0xb6000000;
//
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000) /只有c不会发生整型提升
//		printf("c");
//	return 0;
//
//	// c
//}

//实例2
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	//参与运算所以要整型提升，int 4个字节
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
//	return 0;
//}