#define  _CRT_SECURE_NO_WARNINGS 1

/*************************************/
//#include<stdio.h>
//int main()
//{
//	return 0;
//}

/**************指针概念***********************/
//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int* p = &a; //指针变量
//	*p = 20;
//	return 0;
//}

/***************指针类型**********************/
//#include<stdio.h>
//int main()
//{
//	int a = 0x11223344;
//	//如果p是整形指针，解引用访问了4个字节
//	//int* p = &a;
//	//*p = 0;
//	//如果p是字符指针，解引用访问了1个字节
//	char* p = &a;
//	*p = 0;
//	//指针类型的第一个作用：决定了指针的访问权限，也就是能访问几个字节
//	//指针变量一般类型匹配，访问的字节不多不少
//	return 0;
//}


/***************指针类型意义**********************/
//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 0 };
//	int* pa = arr; //数组名-首元素地址
//	char* pc = arr;
//	printf("%p\n", arr);
//	printf("%p\n",pa);
//	printf("%p\n", pa + 1);
//	printf("---------------------\n");
//	printf("%p\n",pc);
//	printf("%p\n", pc + 1);
//
//	//指针类型的第二个作用：指针类型决定了指针+1，走多大的距离
//	return 0;
//}

/****************指针类型意义*********************/
//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		*(p + i) = i;
//	}
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *(p + i));
//	}
//	return 0;
//}

/****************指针类型意义*********************/
//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 0 };
//	//我希望把arr这10个整型的空间，看作40个字节的空间
//	//给每个字节放一个字符进去
//	int* p = arr;
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		*(p + i) = 'x';
//	}
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *(p + i));
//	}
//	return 0;
//}

/**************野指针***********************/
//#include<stdio.h>
//int* test()
//{
//	int a = 10;
//	return &a;
//}
//int main()
//{
//	//野狗  -
//	//野指针  -
//	//p得到的地址之后，地址指向空间已经释放了，所以这个时候的p是野指针
//	int* p = test();
//	printf("hehe\n");
//	printf("%d\n",*p);
//	return 0;
//}

/****************野指针-指针未初始化*********************/
//#include<stdio.h>
//int main()
//{
//	int* p; //没有任何初始化 - 随机值
//	*p = 20;
//	return 0;
//}

/****************野指针-指针越界访问*********************/
//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	int i = 1;
//	for (i = 0; i < 11; i++) //当i = 10时，数组只有10个位置，p + 10指向的是第11个元素，越界
//	{
//		*(p + i) = i;  //此时p + 10是野指针
//	}
//	return 0;
//}

/****************野指针-指针指向的空间释放*********************/
//例子如/*野指针*/代码

/************避免野指针 - 指针初始化*************************/
//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int* p = &a;
//
//	int *q = NULL;  //NULL - 空指针
//	return 0;
//}

/************避免野指针 - 小心指针越界*************************/

/************避免野指针 - 指针空间释放即使置空******************/
//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 0 };
//	int p2 = arr;
//	//当p2不再直线法arr时
//	p2 = NULL;
//	return 0;
//}

/************避免野指针 - 指针使用之前检查有效性******************/
#include<stdio.h>
int main()
{
	//NULL 指向的空间是不能访问的
	int* p = NULL;
	//*p = 20;   //error
	if (p != NULL)
		*p = 20;
	return 0;
}