#define  _CRT_SECURE_NO_WARNINGS 1

/******************   题目一：分数   ********************/

/*
1 / 1 + 1 / 2 + 1 / 4 + 1 / 8 + 1 / 16 + ....
每项是前一项的一半，如果一共有20项,
求这个和是多少，结果用分数表示出来。
类似：3 / 2  当然，这只是加了前2项而已。分子分母要求互质。

注意：
需要提交的是已经约分过的分数，中间任何位置不能含有空格。
请不要填写任何多余的文字或符号。
*/

//#include<stdio.h>
//#include<math.h>
//int main()
//{
//	int i = 0, x = 0;
//	int a = pow(2, 20) - 1;
//	int b = pow(2, 19);
//	//分子分母互质 -- 求最大公约数
//	for (i = b; i > 0; i--)
//	{
//		if (a % i == 0 && b % i == 0)
//		{
//			x = i;
//			break;
//		}
//	}
//	a = a / x;
//	b = b / x;
//	printf("%d/%d",a,b);
//	return 0;
//}
//1048575/524288

/******************   题目二：星期一   ********************/
/*
整个20世纪（1901年1月1日至2000年12月31日之间），一共有多少个星期一？
//已知2000年12月31日是周日

注意：需要提交的只是一个整数，不要填写任何多余的内容或说明文字。
*/
//#include<stdio.h>
//int main()
//{
//	int year = 0, count = 0, n = 0;
//	//判断闰年 366天
//		//算出中间的所有天数，算出起始的星期,再除
//	int year = 0, sum = 0;
//	for (year = 1901; year <= 2000; year++)
//	{
//		if (((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0))
//			count++;
//	}
//	n = (100 - count) * 365 + count * 366;
//	if (n % 7 == 1)
//		sum++;
//	sum = sum + (n / 7);
//	printf("%d",sum);
//	return 0;
//}
//5217

/******************   题目三：乘积尾零   ********************/
/*
如下的10行数据，每行有10个整数，请你求出它们的乘积的末尾有多少个零？

5650 4542 3554 473 946 4114 3871 9073 90 4329
2758 7949 6113 5659 5245 7432 3051 4434 6704 3594
9937 1173 6866 3397 4759 7557 3070 2287 1453 9899
1486 5722 3135 1170 4014 5510 5120 729 2880 9019
2049 698 4582 4346 4427 646 9742 7340 1230 7683
5693 7015 6887 7381 4172 4341 2909 2027 7355 5649
6701 6645 1671 5978 2704 9926 295 3125 3878 6785
2066 4247 4800 1578 6652 4616 1113 6205 3264 2915
3966 5291 2904 1285 2193 1428 2265 8730 9436 7074
689 5510 8243 6114 337 4096 8199 7313 3685 211

注意：需要提交的是一个整数，表示末尾零的个数。不要填写任何多余内容。
*/
//1. 暴力求解存不下
//2.只有2*5可以产生末尾0，所以可以对所有数进行因式分解，分别计算出所有2和5的总数，较小者即为所求
#include<stdio.h>
int main()
{
	int arr[100] = { 
		5650,4542,3554,473,946,4114,3871,9073,90,4329,
		2758,7949,6113,5659,5245,7432,3051,4434,6704,3594,
		9937,1173,6866,3397,4759,7557,3070,2287,1453,9899,
		1486,5722,3135,1170,4014,5510,5120,729,2880,9019,
		2049,698,4582,4346,4427,646,9742,7340,1230,7683,
		5693,7015,6887,7381,4172,4341,2909,2027,7355,5649,
		6701,6645,1671,5978,2704,9926,295,3125,3878,6785,
		2066,4247,4800,1578,6652,4616,1113,6205,3264,2915,
		3966,5291,2904,1285,2193,1428,2265,8730,9436,7074,
		689,5510,8243,6114,337,4096,8199,7313,3685,211 };
	int i = 0, sum_2 = 0, sum_5 = 0, count = 0;
	for (i = 0; i < 100; i++)
	{
		while (arr[i] % 2 == 0)
		{
			sum_2++;
			arr[i] = arr[i] / 2;
		}
		while (arr[i] % 5 == 0)
		{
			sum_5++;
			arr[i] = arr[i] / 5;
		}
	}
	count = (sum_2 < sum_5) ? sum_2 : sum_5;
	printf("%d\n",count);
	return 0;
}
//31

